<?php

namespace App\Consts;

class AppMessagesConst
{
    const INTRODUCTION = '
    koto-kotoは毎日の出来事や感情を記録し、心の健康を維持するためのアプリです。<br>
    ストレスにうまく対処する「ストレスコーピング」と、<br>
    毎日良いことを3つ見つける「スリー・グッド・シングス」という習慣を活用して、ストレスを減らし、ポジティブな気分を増やすことができます。<br>
    ストレスコーピングは、ストレスをうまく処理する技術や方法で、心身のバランスを保ちます。<br>
    スリー・グッド・シングスは、自分にとって良い出来事や感謝出来ることを毎日3つ挙げることで、ポジティブな感情を養い、幸福感を向上させる習慣です。<br>
    これらの方法を組み合わせ、自分をよりよく理解するしてみましょう！';

    const GLOSSARY = '
    【スリー・グッド・シングス】<br>
    自分にとって良い出来事や感謝出来ることを毎日3つ挙げることで、ポジティブな感情を養い、幸福感を向上させる習慣です。<br>
    この習慣を続けることはポジティブな気持ちを育み、ストレスを和らげ、自分自身の幸福感を高めることに繋がります。<br>
    <br>
    【ストレスコーピング】<br>
    ストレスに適切に対処し心身のバランスを保つための技術や戦略のことを指します。<br>
    ストレスコーピングをうまく行うことでストレスの影響を軽減し、より健康的な生活を送ることができます。';

    const PURPOSE = '
    生活の中で感じた事（デキゴト）を記録していく。就寝前にその日を振り返る<br>
    記録したデキゴトの中からイイコトのベスト3を選ぶ事で、楽しかった事を思い出したり、良かった事を探す事で自己肯定感の向上に役立てる<br>
    記録したデキゴトの中からヤナコトに選んだ物は、その事柄（ストレッサー）に対しての評価を行い、対処法を考える事でストレスコーピング能力の向上に役立てる<br>
    また、ヤナコトの強度を付ける事で自分が何に対してストレスを感じるのか、傾向を視覚化する<br>';

    const USAGE = '
    <li>深く考えずにメモ感覚で出来事を記録する</li>
    <li>空いた時間に記録した出来事を見返す</li>
    <li>イイコトだったかヤナコトだったか振り分ける</li>
    <li>今日のイイコトベスト3を決める（就寝前に行うと良い効果）</li>
    <li>ヤナコトに対する対処法を考える（ストレスに対する対処法を持つ事でストレス軽減に繋げる）</li>';
}
