<?php

namespace App\Consts;

class AppMessagesConst
{
    const INTRODUCTION = '
    koto-kotoは毎日の出来事や感情を記録し、心の健康を維持するためのアプリです。<br>
    ストレスにうまく対処する「ストレスコーピング」と、<br>
    毎日良いことを3つ見つける「スリー・グッド・シングス」という習慣を活用して、ストレスを減らし、ポジティブな気分を増やすことができます。<br>
    ストレスコーピングは、ストレスをうまく処理する技術や方法で、心身のバランスを保ちます。<br>
    スリー・グッド・シングスは、自分にとって良い出来事や感謝出来ることを毎日3つ挙げることで、ポジティブな感情を養い、幸福感を向上させる習慣です。<br>
    これらの方法を組み合わせ、自分をよりよく理解するしてみましょう！';

    const GLOSSARY = '
    【スリー・グッド・シングス】<br>
    自分にとって良い出来事や感謝出来ることを毎日3つ挙げることで、ポジティブな感情を養い、幸福感を向上させる習慣です。<br>
    この習慣を続けることはポジティブな気持ちを育み、ストレスを和らげ、自分自身の幸福感を高めることに繋がります。<br>
    <br>
    【ストレスコーピング】<br>
    ストレスに適切に対処し心身のバランスを保つための技術や戦略のことを指します。<br>
    ストレスコーピングをうまく行うことでストレスの影響を軽減し、より健康的な生活を送ることができます。';

    const INDEX_CHART = [
        'title' => 'グラフ化する期間を指定',
        'submit' => 'グラフ化する',
        'back' => '戻る',
    ];
}
